name: "Spectograms"

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: {
      dim: 16
      dim: 1
      dim: 256
      dim: 90
      }
  }
}
layer {
  name: "labels"
  type: "Input"
  top: "labels"
  input_param {
    shape: {
      dim: 16
      dim: 5
      dim: 1
      dim: 1
      }
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}
  convolution_param {
    bias_term: true
    kernel_size: 5
    num_output: 64
    stride: 1
    pad: 0
    group: 1
    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
 
  }
}
layer {
  name: "conv1-relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: AVE
    kernel_size: 3 # pool over a 3x3 region
    stride: 2      # step two pixels (in the bottom blob) between pooling regions
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}
  convolution_param {
    bias_term: true
    kernel_size: 5
    num_output: 64
    stride: 1
    pad: 0
    group: 1
    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
 
  }
}
layer {
  name: "conv2-relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_h: 3 # pool over a 3x3 region
    kernel_w: 39
    stride: 2      # step two pixels (in the bottom blob) between pooling regions
  }
}

layer {
  name: "fc3"
  type: "InnerProduct"
  bottom: "pool2"
  top: "fc3"

  param { lr_mult: 1,
       decay_mult: 1}
  param { lr_mult: 1,
       decay_mult: 0}

  inner_product_param {
    num_output: 5

    weight_filler {
      type: "xavier"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc3.sig"
  bottom: "fc3"
  top: "fc3"
  type: "Sigmoid"
}

layer {
    name: "distance"
    top: "distance"
    type: "EuclideanLoss"
    bottom: "fc3"
    bottom: "labels"
    loss_weight: 1
}
